#+title: CodeAcademy Databases
#+date: <2023-01-29 15:45>
#+description: CodeAcademy Databases notes
#+filetags: databases codeacademy
#+OPTIONS: toc:2
#+OPTIONS: num:t

* Lesson 1 - Ivadas i duomenu bazes

SVARBIAUSIOS SQL UZKLAUSOS

~SELECT~ sakinys naudojamas įrašams iš vienos ar daugiau lentelių
atrinkti.
~FROM~ sakinyje nurodomos lentelės, iš kurių reikia išrinkti eilutes
(sąryšiai gali būti nurodomi skirtingais JOIN variantais).
~WHERE~ sakinyje nurodoma sąlyga, kurią turi tenkinti grąžinamos
eilutės.
~GROUP~ BY sąlygoje nurodoma, kad reikia grupuoti tam tikras eilutes.
Grupuojant eilutes, dažniausiai naudojamos agregatinės funkcijos
maksimalioms, vidutinėms ir panašioms reikšmėms išrinkti iš grupuotų
eilučių.
~ORDER~ BY sakiniu nurodoma viena ar daugiau rikiavimo sąlygų.
~HAVING~ sakinyje nurodomas kriterijus, taikomas grupuojamoms eilutėms;
~HAVING~ raktinis žodis gali būti naudojamas tik tais atvejais, jeigu
užklausoje yra GROUP BY sakinys.
~INSERT~ vartojamas naujų įrašų įterpimui į lentelę.
~DELETE~ leidžia ištrinti įrašus iš lentelės.
~UPDATE~ naudojamas pakeisti vieno ar daugiau įrašų reikšmes.
~DISTINCT~ - skirtingų reikšmių išrinkimas.
~DROP TABLE~ pašalina visą lentelę.

KAIP SUKURTI LENTELĘ

#+begin_src sql
CREATE TABLE darbuotojai (vardas text, pavarde text, atlyginimas integer)
#+end_src

KAIP ĮDĖTI ĮRAŠĄ (EILUTĘ) Į LENTELĘ:

#+begin_src sql
INSERT INTO darbuotojai (vardas, pavarde, atlyginimas) VALUES (naujasvardas, naujapavarde, naujasatlyginimas)
#+end_src

KAIP PERŽIŪRĖTI ĮRAŠUS LENTELĖJE:

#+begin_src sql
SELECT * FROM darbuotojai
SELECT * FROM darbuotojai WHERE pavarde = "ieskomapavarde"
#+end_src

KAIP PAKEISTI ĮRAŠĄ LENTELĖJE:

#+begin_src sql
UPDATE darbuotojai SET atlyginimas = naujasatlyginimas WHERE pavarde = ieskomapavarde
#+end_src

KAIP IŠTRINTI LENTELĖS ĮRAŠĄ:

#+begin_src sql
DELETE from darbuotojai WHERE vardas = ieskomasvardas AND pavarde = ieskomapavarde
#+end_src

PRAKTIKA: DUOMENŲ IŠRINKIMAS IR VALDYMAS

Parsisiųskite [[https://github.com/CodeAcademy-Online/Python/tree/lesson-11/pradiniai-failai][lentelę]], atsidarykite ją programoje [[https://sqlitebrowser.org/][DB Browser for
SQLite]] ir skiltyje "Execute SQL" atlikite šias SQL užklausas:

su emacs

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai.db :colnames yes
   -- DELETE from darbuotojai WHERE PAVARDĖ = "Sabutis"
    -- select * from darbuotojai where vardas = "Petras"
  -- UPDATE darbuotojai SET PAREIGOS = "IT Technikas" WHERE PAVARDĖ = "Petrauskas"
       -- select * from darbuotojai
     -- SELECT COUNT(PAREIGOS) FROM DARBUOTOJAI WHERE PAREIGOS = "IT Technikas";
     UPDATE DARBUOTOJAI SET PAREIGOS = "testuotojas" WHERE PAVARDĖ = "Gabalis"
#+end_src
#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai.db :colnames yes
   -- DELETE from darbuotojai WHERE PAVARDĖ = "Sabutis"
    -- select * from darbuotojai where vardas = "Petras"
  -- UPDATE darbuotojai SET PAREIGOS = "IT Technikas" WHERE PAVARDĖ = "Petrauskas"
       select * from darbuotojai
#+end_src
#+RESULTS:
| VARDAS    | PAVARDĖ       | GIMIMO_DATA | PAREIGOS       | SKYRIUS_PAVADINIMAS |
|-----------+---------------+-------------+----------------+---------------------|
| Martynas  | Jačas         |  1980-09-20 | Programuotojas | Gamybos             |
| Goda      | Jablonkskaitė |  1986-02-11 | Vadybininkas   | Pardavimų           |
| Mantas    | Gabalis       |  1990-08-20 | testuotojas    | Gamybos             |
| Arnoldas  | Lukas         |  1994-02-13 | Programuotojas | Gamybos             |
| Maja      | Jačiulytė     |  1998-03-12 | Buhalterė      | Finansų             |
| Mikas     | Taileikis     |  2000-04-23 | Programuotojas | Gamybos             |
| Giedrius  | Vaicekauskas  |  1986-05-30 | Vadovas        | Vadovybės           |
| Romas     | Babavičius    |  1986-09-19 | Finansininkas  | Finansų             |
| Milda     | Babavičiūtė   |  1986-09-19 | Testuotojas    | Gamybos             |
| Domas     | Sabaliauskas  |  1999-03-13 | Testuotojas    | Gamybos             |
| Tautvydas | Ubartas       |  1980-05-30 | Programuotojas | Gamybos             |
| Arnoldas  | Jačas         |  1985-06-30 | Programuotojas | Gamybos             |
| Jaunius   | Šindeikis     |  1988-03-12 | Vadovas        | Gamybos             |
| Rimantas  | Kundrotas     |  1987-11-12 | Programuotojas | Gamybos             |
| Petras    | Petrauskas    |  1999-12-12 | IT Technikas   | Vadovas             |
| Petras    | Petrauskas    |  1999-12-12 | IT Technikas   | Vadovas             |

#+begin_src sql
  -- Pasirinkite visus duomenis iš lentelės “DARBUOTOJAI”.
  SELECT * from DARBUOTOJAI

  -- Pasirinkite visus duomenis iš stulpelio “GIMIMO_DATA” - lentelėje
  -- “DARBUOTOJAS”.

  SELECT GIMIMO_DATA from DARBUOTOJAI

  -- Pasirinkite visus duomenis iš stulpelių “VARDAS”,”PAVARDĖ”,
  -- “PAREIGOS” - lentelėje “DARBUOTOJAI”.

  SELECT VARDAS, PAVARDĖ, PAREIGOS from DARBUOTOJAI

  -- Pasirinkite skirtingas reikšmes iš stulpelio SKYRIUS_PAVADINIMAS -
  -- lentelėje “DARBUOTOJAI”.

  SELECT DISTINCT SKYRIUS_PAVADINIMAS FROM DARBUOTOJAI

  -- Pasirinkite visus duomenis apie darbuotojus, kurie dirba Gamybos
  -- skyriuje.

  SELECT * FROM DARBUOTOJAI WHERE SKYRIUS_PAVADINIMAS = "Gamybos"

  -- Pasirinkite duomenis, kokias pareigas užima Giedrius,

  SELECT * FROM DARBUOTOJAI WHERE VARDAS = "Giedrius"

  -- Pasirinkite visus duomenis apie darbuotojus, kurių gimimo data -
  -- 1986-09-19.

  SELECT * FROM DARBUOTOJAI WHERE GIMIMO_DATA = "1986-09-19"

  -- Pasirinkite darbuotojų vardus, kurių pavardės yra Sabutis.

  SELECT * FROM DARBUOTOJAI WHERE PAVARDĖ = "Sabutis"

  -- Pasirinkite duomenis (vardą ir pavardę) apie programuotojus iš Gamybos
  -- skyriaus.

  SELECT VARDAS,PAVARDĖ FROM DARBUOTOJAI WHERE PAREIGOS = "Programuotojas"

  -- Įterpkite į lentelę “DARBUOTOJAI” naują darbuotoją, užpildydami visus
  -- reikiamus laukus (vardą, pavardę, gimimo datą, pareigas ir skyriaus
  -- pavadinimą).

  INSERT INTO darbuotojai (VARDAS, PAVARDĖ, GIMIMO_DATA, PAREIGOS, SKYRIUS_PAVADINIMAS) VALUES ("Petras", "Petrauskas", "1999-12-12", "Slavejas", "Vadovas")

  -- Įterpkite į lentelę “DARBUOTOJAI” naują darbuotoją, užpildydami tik
  -- laukus (vardą, pavardę, gimimo datą). Pareigas ir skyriaus pavadinimą
  -- palikite neužpildytus.

  INSERT INTO darbuotojai (VARDAS, PAVARDĖ, GIMIMO_DATA) VALUES ("Antanas", "Antanauskas", "1999-105-12")

  -- Užpildykite likusius tuščius laukus “DARBUOTOJAI” lentelėje, jūsų
  -- prieš tai įterptame įraše. Priskirkite darbuotojui pareigas ir skyrių.

  UPDATE darbuotojai SET PAREIGOS = "IT Technikas" WHERE PAVARDĖ = "Antanauskas"
  UPDATE darbuotojai SET SKYRIUS_PAVADINIMAS = "IT" WHERE PAVARDĖ = "Antanauskas"

  -- Ištrinkite lentelės “DARBUOTOJAI” įrašą, kurio gimimo data yra tokia,
  -- kurią jūs sukūrėte.

  DELETE from darbuotojai WHERE GIMIMO_DATA = "1999-105-12" AND PAVARDĖ = "Antanauskas"

  -- Įterpkite, du darbuotojus, pavarde Antanaitis kurių pareigos būtų
  -- “Programuotojas”.

  INSERT INTO darbuotojai (PAVARDĖ) VALUES ("Antanaitis")

  -- Pakeiskite, abiejų Antanaičių pareigas į “Testuotojas” vienu sakiniu.

  UPDATE DARBUOTOJAI SET PAREIGOS = "testuotojas" WHERE PAVARDĖ = "Antanaitis"

  -- Suskaičiuokite, kiek įmonėje dirba Testuotojų.

  SELECT COUNT(PAREIGOS) FROM DARBUOTOJAI WHERE PAREIGOS = "testuotojas";
#+end_src
* Lesson 2 - WHERE panaudojimas

BETWEEN...AND

Nurodo žemiausios ir aukščiausios reikšmių intervalą, išrenkant
duomenis iš lentelės, t.y. rezultate pateikia duomenis tam tikram
reikšmių intervalui:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
  select * from mashinos
#+end_src

#+RESULTS:
| make       | model      | color      | year | price |
|------------+------------+------------+------+-------|
| Audi       | V8         | Red        | 1992 | 95940 |
| Subaru     | SVX        | Aquamarine | 1993 | 14128 |
| Pontiac    | Bonneville | Orange     | 1991 | 94076 |
| Ford       | Probe      | Orange1993 | 1993 | 95940 |
| Dodge      | Daytona    | Green      | 1989 | 23333 |
| Dodge      | Petrona    | Pink       | 1988 | 50000 |
| Volkswagen | Gofl       | Pink       | 1988 | 50000 |
| Volvo      | S40        | Pink       | 1988 | 50000 |
| Volvo      | S40        | null       | 1988 | 50000 |
| Ford       | Fiesta     | null       | 1988 | 50000 |
| Ford       | Fiesta     |            | 1988 | 50000 |
| Peugeot    | Mondeo     |            | 1988 | 50000 |

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
  -- INSERT INTO mashinos (make, model, color, year, price) VALUES ("Dodge", "Petrona", "Pink", "1988", "50000")
  INSERT INTO mashinos (make, model, color, year, price) VALUES ("Peugeot", "Mondeo", NULL, "1988", "50000")
#+end_src

#+RESULTS:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
  SELECT * FROM mashinos WHERE year BETWEEN 1980 AND 1990;
#+end_src

#+RESULTS:
| make  | model   | color | year | price |
|-------+---------+-------+------+-------|
| Dodge | Daytona | Green | 1989 | 23333 |
| Dodge | Petrona | Pink  | 1988 | 50000 |

BETWEEN ... AND operatorius apima ir kraštutines reikšmes.

IN

Isrenka rezultatus pagal pateikta sarasa

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos where year in (1993)
#+end_src

#+RESULTS:
| make   | model | color      | year | price |
|--------+-------+------------+------+-------|
| Subaru | SVX   | Aquamarine | 1993 | 14128 |
| Ford   | Probe | Orange1993 | 1993 | 95940 |

LIKE

Duomenu isrinkimui is lenteles naudoja sablona:
- ~%~ - reiskia nuli arba keleta simboliu
- ~_~ - reiskia viena simboli

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos where make LIKE 'V%'
#+end_src

#+RESULTS:
| make       | model | color | year | price |
|------------+-------+-------+------+-------|
| Volkswagen | Gofl  | Pink  | 1988 | 50000 |
| Volvo      | S40   | Pink  | 1988 | 50000 |

Kitas pvz. - išrenka eilutes, kuriose modelis iš 2-jų simbolių:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos where model LIKE '__'
#+end_src

#+RESULTS:
| make | model | color | year | price |
|------+-------+-------+------+-------|
| Audi | V8    | Red   | 1992 | 95940 |

arba, tarkime:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos where make LIKE '__d%'
#+end_src

#+RESULTS:
| make  | model   | color | year | price |
|-------+---------+-------+------+-------|
| Audi  | V8      | Red   | 1992 | 95940 |
| Dodge | Daytona | Green | 1989 | 23333 |
| Dodge | Petrona | Pink  | 1988 | 50000 |

Išrinktos eilutės, kuriose gamintojo (make) pavadinime trečia raidė yra n:

IS NULL

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos where color IS null
#+end_src

#+RESULTS:
| make    | model  | color | year | price |
|---------+--------+-------+------+-------|
| Ford    | Fiesta |       | 1988 | 50000 |
| Peugeot | Mondeo |       | 1988 | 50000 |

AND, OR, NOT

Naudojami salygu kombinavimui, pvz:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos where make = "Ford" AND price > 40000
#+end_src

#+RESULTS:
| make | model  | color      | year | price |
|------+--------+------------+------+-------|
| Ford | Probe  | Orange1993 | 1993 | 95940 |
| Ford | Fiesta | null       | 1988 | 50000 |
| Ford | Fiesta |            | 1988 | 50000 |

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos where make = "Ford" OR year > 1992
#+end_src

#+RESULTS:
| make   | model  | color      | year | price |
|--------+--------+------------+------+-------|
| Subaru | SVX    | Aquamarine | 1993 | 14128 |
| Ford   | Probe  | Orange1993 | 1993 | 95940 |
| Ford   | Fiesta | null       | 1988 | 50000 |
| Ford   | Fiesta |            | 1988 | 50000 |

Prieš kiekvieną sąlygą galima naudoti NOT:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos where color NOT in ("Violet", "Orange", "Pink", "Red", "Aquamarine", "Green", "null")
#+end_src

#+RESULTS:
| make | model | color      | year | price |
|------+-------+------------+------+-------|
| Ford | Probe | Orange1993 | 1993 | 95940 |

Sudėtingesnis pavyzdys:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos where (make = "Volvo" OR make = "Ford") and price NOT BETWEEN 10000 AND 60000
#+end_src

#+RESULTS:
| make | model | color      | year | price |
|------+-------+------------+------+-------|
| Ford | Probe | Orange1993 | 1993 | 95940 |

Pirmenybes atliekant lyginimo operacija:

1. visi lyginimo operatoriai
2. NOT
3. AND
4. OR

ORDER BY, DESC
Nustato, kaip turi būti išrūšiuoti duomenys užklausos rezultate. Pvz.:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos
#+end_src

#+RESULTS:
| make       | model      | color      | year | price |
|------------+------------+------------+------+-------|
| Audi       | V8         | Red        | 1992 | 95940 |
| Subaru     | SVX        | Aquamarine | 1993 | 14128 |
| Pontiac    | Bonneville | Orange     | 1991 | 94076 |
| Ford       | Probe      | Orange1993 | 1993 | 95940 |
| Dodge      | Daytona    | Green      | 1989 | 23333 |
| Dodge      | Petrona    | Pink       | 1988 | 50000 |
| Volkswagen | Gofl       | Pink       | 1988 | 50000 |
| Volvo      | S40        | Pink       | 1988 | 50000 |
| Volvo      | S40        | null       | 1988 | 50000 |
| Ford       | Fiesta     | null       | 1988 | 50000 |
| Ford       | Fiesta     |            | 1988 | 50000 |
| Peugeot    | Mondeo     |            | 1988 | 50000 |

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos ORDER BY price
#+end_src

#+RESULTS:
| make       | model      | color      | year | price |
|------------+------------+------------+------+-------|
| Subaru     | SVX        | Aquamarine | 1993 | 14128 |
| Dodge      | Daytona    | Green      | 1989 | 23333 |
| Dodge      | Petrona    | Pink       | 1988 | 50000 |
| Volkswagen | Gofl       | Pink       | 1988 | 50000 |
| Volvo      | S40        | Pink       | 1988 | 50000 |
| Volvo      | S40        | null       | 1988 | 50000 |
| Ford       | Fiesta     | null       | 1988 | 50000 |
| Ford       | Fiesta     |            | 1988 | 50000 |
| Peugeot    | Mondeo     |            | 1988 | 50000 |
| Pontiac    | Bonneville | Orange     | 1991 | 94076 |
| Audi       | V8         | Red        | 1992 | 95940 |
| Ford       | Probe      | Orange1993 | 1993 | 95940 |

Jeigu norime atvirkštinio rūšiavimo, naudojame DESC:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos ORDER BY price DESC
#+end_src

#+RESULTS:
| make       | model      | color      | year | price |
|------------+------------+------------+------+-------|
| Audi       | V8         | Red        | 1992 | 95940 |
| Ford       | Probe      | Orange1993 | 1993 | 95940 |
| Pontiac    | Bonneville | Orange     | 1991 | 94076 |
| Dodge      | Petrona    | Pink       | 1988 | 50000 |
| Volkswagen | Gofl       | Pink       | 1988 | 50000 |
| Volvo      | S40        | Pink       | 1988 | 50000 |
| Volvo      | S40        | null       | 1988 | 50000 |
| Ford       | Fiesta     | null       | 1988 | 50000 |
| Ford       | Fiesta     |            | 1988 | 50000 |
| Peugeot    | Mondeo     |            | 1988 | 50000 |
| Dodge      | Daytona    | Green      | 1989 | 23333 |
| Subaru     | SVX        | Aquamarine | 1993 | 14128 |

Analogiškai tekstiniai įrašai rūšiuojasi pagal abėcėlę:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos ORDER BY make
#+end_src

#+RESULTS:
| make       | model      | color      | year | price |
|------------+------------+------------+------+-------|
| Audi       | V8         | Red        | 1992 | 95940 |
| Dodge      | Daytona    | Green      | 1989 | 23333 |
| Dodge      | Petrona    | Pink       | 1988 | 50000 |
| Ford       | Probe      | Orange1993 | 1993 | 95940 |
| Ford       | Fiesta     | null       | 1988 | 50000 |
| Ford       | Fiesta     |            | 1988 | 50000 |
| Peugeot    | Mondeo     |            | 1988 | 50000 |
| Pontiac    | Bonneville | Orange     | 1991 | 94076 |
| Subaru     | SVX        | Aquamarine | 1993 | 14128 |
| Volkswagen | Gofl       | Pink       | 1988 | 50000 |
| Volvo      | S40        | Pink       | 1988 | 50000 |
| Volvo      | S40        | null       | 1988 | 50000 |

Case insensitive paieška

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select * from mashinos WHERE make = "dodge" collate nocase
#+end_src

#+RESULTS:
| make  | model   | color | year | price |
|-------+---------+-------+------+-------|
| Dodge | Daytona | Green | 1989 | 23333 |
| Dodge | Petrona | Pink  | 1988 | 50000 |

II yra sujungimo operatorius (concatenate operator AKA pipe or
paipas), naudojamas string reikšmių apjungimui paieškos rezultate:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select "GAMINTOJAS: " || make, model FROM mashinos
#+end_src

#+RESULTS:
| GAMINTOJAS:            |            | make | model |
|------------------------+------------+------+-------|
| GAMINTOJAS: Audi       | V8         |      |       |
| GAMINTOJAS: Subaru     | SVX        |      |       |
| GAMINTOJAS: Pontiac    | Bonneville |      |       |
| GAMINTOJAS: Ford       | Probe      |      |       |
| GAMINTOJAS: Dodge      | Daytona    |      |       |
| GAMINTOJAS: Dodge      | Petrona    |      |       |
| GAMINTOJAS: Volkswagen | Gofl       |      |       |
| GAMINTOJAS: Volvo      | S40        |      |       |
| GAMINTOJAS: Volvo      | S40        |      |       |
| GAMINTOJAS: Ford       | Fiesta     |      |       |
| GAMINTOJAS: Ford       | Fiesta     |      |       |
| GAMINTOJAS: Peugeot    | Mondeo     |      |       |


#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select make||" "|| model AS "Full_name", year, price FROM mashinos
#+end_src

Šiuo atveju nurodėme, kaip vadinsime stulpelį t.y. full_name. Kitose
DB, pvz Postgres, šiam veiksmui galime naudoti CONCAT paragrafą,
tačiau SQLITE jis neveikia.

#+RESULTS:
| Full_name          | year | price |
|--------------------+------+-------|
| Audi V8            | 1992 | 95940 |
| Subaru SVX         | 1993 | 14128 |
| Pontiac Bonneville | 1991 | 94076 |
| Ford Probe         | 1993 | 95940 |
| Dodge Daytona      | 1989 | 23333 |
| Dodge Petrona      | 1988 | 50000 |
| Volkswagen Gofl    | 1988 | 50000 |
| Volvo S40          | 1988 | 50000 |
| Volvo S40          | 1988 | 50000 |
| Ford Fiesta        | 1988 | 50000 |
| Ford Fiesta        | 1988 | 50000 |
| Peugeot Mondeo     | 1988 | 50000 |

Skaičiavimai

Užklausose galime nurodyti, kokius aritmetinius veiksmus
norime atlikti su stulpeliu, prieš jį atvaizduojant rezultate:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
select make, model, 2021 - year AS "age" from mashinos
#+end_src

#+RESULTS:
| make       | model      | age |
|------------+------------+-----|
| Audi       | V8         |  29 |
| Subaru     | SVX        |  28 |
| Pontiac    | Bonneville |  30 |
| Ford       | Probe      |  28 |
| Dodge      | Daytona    |  32 |
| Dodge      | Petrona    |  33 |
| Volkswagen | Gofl       |  33 |
| Volvo      | S40        |  33 |
| Volvo      | S40        |  33 |
| Ford       | Fiesta     |  33 |
| Ford       | Fiesta     |  33 |
| Peugeot    | Mondeo     |  33 |

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
SELECT make, model, price, ROUND(price / 121.0 * 100, 2) AS "be PVM" FROM mashinos
#+end_src

Šiuo atveju naudojome funkciją ROUND gauto rezultato suapvalinimui.
Nulis po kablelio (121.0) panaudotas tam, kad gautume float reikšmę
pirmoje dalyboje.

#+RESULTS:
| make       | model      | price |   be PVM |
|------------+------------+-------+----------|
| Audi       | V8         | 95940 | 79289.26 |
| Subaru     | SVX        | 14128 | 11676.03 |
| Pontiac    | Bonneville | 94076 | 77748.76 |
| Ford       | Probe      | 95940 | 79289.26 |
| Dodge      | Daytona    | 23333 | 19283.47 |
| Dodge      | Petrona    | 50000 | 41322.31 |
| Volkswagen | Gofl       | 50000 | 41322.31 |
| Volvo      | S40        | 50000 | 41322.31 |
| Volvo      | S40        | 50000 | 41322.31 |
| Ford       | Fiesta     | 50000 | 41322.31 |
| Ford       | Fiesta     | 50000 | 41322.31 |
| Peugeot    | Mondeo     | 50000 | 41322.31 |

Grupavimas
Grupavimui dažniausiai naudojamos funkcijos:

~AVG()~ - nustato vidurkį grupei

~COUNT()~ - nustato eilučių, kurių išraiška yra apibrėžta, kiekį lentelėje

~MAX()~ - nustato didžiausią reikšmę

~MIN()~ - nustato mažiausią reikšmę

~SUM()~ - nustato bendrą sumą, ignoruojant neapibrėžtas reikšmes

Funkcijų naudojimas be grupavimo:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
SELECT MIN(price), MAX(price), AVG(price) from mashinos
#+end_src

#+RESULTS:
| MIN(price) | MAX(price) |       AVG(price) |
|------------+------------+------------------|
|      14128 |      95940 | 56118.0833333333 |

Suraskime pigiausią fordą:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
SELECT make, model, min(price) FROM mashinos WHERE make="Ford"
#+end_src

#+RESULTS:
| make | model  | min(price) |
|------+--------+------------|
| Ford | Fiesta |      50000 |

Pavyzdžiai su grupavimu:

Išrinkime kiek ir kokių automobilių yra lentelėje:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
SELECT make, count(*) FROM mashinos GROUP BY make ORDER BY count(*) DESC;
#+end_src

#+RESULTS:
| make       | count(*) |
|------------+----------|
| Ford       |        3 |
| Volvo      |        2 |
| Dodge      |        2 |
| Volkswagen |        1 |
| Subaru     |        1 |
| Pontiac    |        1 |
| Peugeot    |        1 |
| Audi       |        1 |

Padarykime lentelę, kurioje matytųsi brangiausios spalvos:

#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
SELECT color, max(price), make, model FROM mashinos GROUP BY color ORDER BY price DESC
#+end_src

#+RESULTS:
| color      | max(price) | make    | model      |
|------------+------------+---------+------------|
| Red        |      95940 | Audi    | V8         |
| Orange1993 |      95940 | Ford    | Probe      |
| Orange     |      94076 | Pontiac | Bonneville |
| null       |      50000 | Volvo   | S40        |
| Pink       |      50000 | Dodge   | Petrona    |
|            |      50000 | Ford    | Fiesta     |
| Green      |      23333 | Dodge   | Daytona    |
| Aquamarine |      14128 | Subaru  | SVX        |

Darant kompleksiškas užklausas, reikėtų laikytis tokio eiliškumo:

- SELECT stulpelis, grupinė_funkcija
- FROM lentelė
- [WHERE sąlyga]
- [GROUP BY sąrašas_grupavimui]
- [HAVING grupės sąlyga]
- [ORDER BY rūšiavimo sąlyga]


#+begin_src sqlite :db ~/Dropbox/src/db/cars.db :colnames yes
SELECT make, model, year, max(price) FROM mashinos WHERE make NOT IN ("Volvo") GROUP BY price HAVING year > 1990 ORDER BY make;
#+end_src

#+RESULTS:
| make    | model      | year | max(price) |
|---------+------------+------+------------|
| Audi    | V8         | 1992 |      95940 |
| Pontiac | Bonneville | 1991 |      94076 |
| Subaru  | SVX        | 1993 |      14128 |

Išrinktos brangiausios mašinos, kurių tarpe nėra toyotų, mercury ir
volvo. Išfiltruotos tos, kurios senesnės už 1990m. Išrūšiuotos pagal
gamintoją.

#+RESULTS:

PRAKTIKA: SQL WHERE CLAUSE

Parsisiųskite darbuotojai2.db duomenų bazę, atsidarykite ją programoje
DB Browser for SQLite ir skiltyje "Execute SQL" atlikite šias SQL
užklausas:

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
select * from darbuotojas
#+end_src

#+RESULTS:
| ID | VARDAS    | PAVARDĖ       | ASMENS_KODAS | PAREIGOS       |  DIRBA_NUO | SKYRIUS_ID | PROJEKTAS_ID |
|----+-----------+---------------+--------------+----------------+------------+------------+--------------|
|  1 | Martynas  | Jačas         |  38009200000 | Programuotojas | 2011-02-02 |          2 |            1 |
|  2 | Goda      | Jablonkskaitė |  48602110000 | Vadybininkas   | 2009-04-06 |          3 |            2 |
|  3 | Mantas    | Gabalis       |  39008200000 | Testuotojas    | 2012-12-15 |          2 |            1 |
|  4 | Arnoldas  | Lukas         |  39402130000 | Programuotojas | 2002-02-30 |          2 |            2 |
|  5 | Maja      | Jačiulytė     |  49803120000 | Buhalterė      | 2015-11-30 |          1 |            3 |
|  6 | Mikas     | Taileikis     |  50004230000 | Programuotojas | 2008-05-25 |          2 |            4 |
|  7 | Giedrius  | Vaicekauskas  |  38605300000 | Vadovas        | 2010-07-30 |          4 |            5 |
|  8 | Romas     | Babavičius    |  38609190000 | Finansininkas  | 2011-09-30 |          1 |            5 |
|  9 | Milda     | Babavičiūtė   |  48609190000 | Testuotojas    | 2010-07-15 |          2 |            2 |
| 10 | Domas     | Sabaliauskas  |  39903130000 | Testuotojas    | 2016-08-15 |          2 |            2 |
| 11 | Dainius   | Sabutis       |  39806230000 | Vadybininkas   | 2018-12-12 |          3 |            2 |
| 12 | Tautvydas | Ubartas       |  38005300000 | Programuotojas | 2017-06-06 |          2 |            3 |
| 13 | Henrikas  | Sabutis       |  39402020000 | Vadybininkas   | 2018-02-02 |          3 |            3 |
| 14 | Arnoldas  | Jačas         |  38506300000 | Programuotojas | 2014-03-03 |          2 |            2 |
| 15 | Jaunius   | Šindeikis     |  38803120000 | Vadovas        | 2014-06-08 |          2 |            1 |
| 16 | Rimantas  | Kundrotas     |  38711120000 | Programuotojas | 2017-02-02 |          2 |            3 |
| 17 | Egidijus  | Antanaitis    |  39002130000 | Testuotojas    | 2011-02-03 |          2 |            4 |
| 18 | Lukas     | Antanaitis    |  38809130000 | Testuotojas    | 2011-12-02 |          2 |            4 |
| 19 | Arnas     | Lukša         |  38807200000 |                | 2009-11-15 |            |            5 |
| 20 | Urtė      | Lukaitė       |  60202020000 |                | 2005-02-02 |            |              |

Išrinkite duomenis apie darbuotoją (asmens kodą, vardą ir pavardę) iš
lentelės DARBUOTOJAS, kuris gimęs 1988 m. liepos 20 d.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
SELECT vardas, PAVARDĖ, asmens_kodas FROM darbuotojas where asmens_kodas LIKE '_880720%'
#+end_src

#+RESULTS:
| VARDAS | PAVARDĖ | ASMENS_KODAS |
|--------+---------+--------------|
| Arnas  | Lukša   |  38807200000 |

Išrinkite duomenis apie darbuotojus (nuo kada dirba, asmens kodą) iš
lentelės DARBUOTOJAS, kurie būtų įsidarbinę nuo 2009 m. spalio 30 d.
iki 2012 m. lapkričio 11d.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
SELECT dirba_nuo, asmens_kodas FROM darbuotojas where dirba_nuo between "2009-10-30" and "2017-11-11" Order by dirba_nuo
#+end_src

#+RESULTS:
|  DIRBA_NUO | ASMENS_KODAS |
|------------+--------------|
| 2009-11-15 |  38807200000 |
| 2010-07-15 |  48609190000 |
| 2010-07-30 |  38605300000 |
| 2011-02-02 |  38009200000 |
| 2011-02-03 |  39002130000 |
| 2011-09-30 |  38609190000 |
| 2011-12-02 |  38809130000 |
| 2012-12-15 |  39008200000 |
| 2014-03-03 |  38506300000 |
| 2014-06-08 |  38803120000 |
| 2015-11-30 |  49803120000 |
| 2016-08-15 |  39903130000 |
| 2017-02-02 |  38711120000 |
| 2017-06-06 |  38005300000 |

Išrinkite duomenis apie darbuotojus (vardą, Skyriaus ID ir Projekto
ID) iš lentelės DARBUOTOJAS, kurie dirba 2-ame ir 3-ame skyriuose
(panaudojant IN operatorių).

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
  SELECT vardas, SKYRIUS_ID, PROJEKTAS_ID FROM darbuotojas WHERE skyrius_id in (2,3)
  -- select * from darbuotojas
#+end_src

#+RESULTS:
| VARDAS    | SKYRIUS_ID | PROJEKTAS_ID |
|-----------+------------+--------------|
| Martynas  |          2 |            1 |
| Goda      |          3 |            2 |
| Mantas    |          2 |            1 |
| Arnoldas  |          2 |            2 |
| Mikas     |          2 |            4 |
| Milda     |          2 |            2 |
| Domas     |          2 |            2 |
| Dainius   |          3 |            2 |
| Tautvydas |          2 |            3 |
| Henrikas  |          3 |            3 |
| Arnoldas  |          2 |            2 |
| Jaunius   |          2 |            1 |
| Rimantas  |          2 |            3 |
| Egidijus  |          2 |            4 |
| Lukas     |          2 |            4 |

Išrinkite duomenis (vardą, pavarde ir asmens kodą) apie visas moteris
iš lentelės DARBUOTOJAS (panaudojant operatorių LIKE).

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
  select * from darbuotojas where asmens_kodas like "4%"
  -- select * from darbuotojas
#+end_src

#+RESULTS:
| ID | VARDAS | PAVARDĖ       | ASMENS_KODAS | PAREIGOS     |  DIRBA_NUO | SKYRIUS_ID | PROJEKTAS_ID |
|----+--------+---------------+--------------+--------------+------------+------------+--------------|
|  2 | Goda   | Jablonkskaitė |  48602110000 | Vadybininkas | 2009-04-06 |          3 |            2 |
|  5 | Maja   | Jačiulytė     |  49803120000 | Buhalterė    | 2015-11-30 |          1 |            3 |
|  9 | Milda  | Babavičiūtė   |  48609190000 | Testuotojas  | 2010-07-15 |          2 |            2 |

Išrinkite visus duomenis apie visus darbuotojus iš lentelės
DARBUOTOJAS, kurie yra gimę 12 dieną (panaudojant operatorių LIKE).

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
  select * from darbuotojas where asmens_kodas like "_____12____"
  -- select * from darbuotojas
#+end_src

#+RESULTS:
| ID | VARDAS   | PAVARDĖ   | ASMENS_KODAS | PAREIGOS       |  DIRBA_NUO | SKYRIUS_ID | PROJEKTAS_ID |
|----+----------+-----------+--------------+----------------+------------+------------+--------------|
|  5 | Maja     | Jačiulytė |  49803120000 | Buhalterė      | 2015-11-30 |          1 |            3 |
| 15 | Jaunius  | Šindeikis |  38803120000 | Vadovas        | 2014-06-08 |          2 |            1 |
| 16 | Rimantas | Kundrotas |  38711120000 | Programuotojas | 2017-02-02 |          2 |            3 |

Išrinkite visus projektus iš lentelės PROJEKTAS, kurių pavadinime
antra raidė būtų “a”.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
  select * from projektas where pavadinimas like "_a%"
  -- select * from projektas
  -- select * from darbuotojas
#+end_src

#+RESULTS:
| ID | PAVADINIMAS |
|----+-------------|
|  1 | Galerija    |
|  4 | Pardavimai  |

Išrinkite visus darbuotojus iš lentelės DARBUOTOJAS, kuriems
nepaskirtos jokios pareigos.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
  -- select * from projektas where pavadinimas like "_a%"
  -- select * from projektas
  select * from darbuotojas where pareigos is null
#+end_src

#+RESULTS:
| ID | VARDAS | PAVARDĖ | ASMENS_KODAS | PAREIGOS |  DIRBA_NUO | SKYRIUS_ID | PROJEKTAS_ID |
|----+--------+---------+--------------+----------+------------+------------+--------------|
| 19 | Arnas  | Lukša   |  38807200000 |          | 2009-11-15 |            |            5 |
| 20 | Urtė   | Lukaitė |  60202020000 |          | 2005-02-02 |            |              |

Išrinkite duomenis apie darbuotojus (vardą, pavardę, nuo kada dirba ir
pareigas), kurie dirba nuo 2011-02-02 ir jų pareigos yra
Programuotojai.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
  select vardas, PAVARDĖ, dirba_nuo, pareigos from darbuotojas where pareigos="Programuotojas" and dirba_nuo="2011-02-02"
  -- select * from projektas
  -- select * from darbuotojas
#+end_src

#+RESULTS:
| VARDAS   | PAVARDĖ |  DIRBA_NUO | PAREIGOS       |
|----------+---------+------------+----------------|
| Martynas | Jačas   | 2011-02-02 | Programuotojas |

Išrinkite duomenis apie darbuotojus (vardą, pavardę, Skyriaus ID ir
Projekto ID) iš lentelės DARBUOTOJAS, kurie yra iš Gamybos (2)
skyriaus arba 1 projekto.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
  select vardas, PAVARDĖ, skyrius_id, projektas_id from darbuotojas where skyrius_id = "2" or projektas_id="1"
  -- select * from projektas
  -- select * from darbuotojas
#+end_src

#+RESULTS:
| VARDAS    | PAVARDĖ      | SKYRIUS_ID | PROJEKTAS_ID |
|-----------+--------------+------------+--------------|
| Martynas  | Jačas        |          2 |            1 |
| Mantas    | Gabalis      |          2 |            1 |
| Arnoldas  | Lukas        |          2 |            2 |
| Mikas     | Taileikis    |          2 |            4 |
| Milda     | Babavičiūtė  |          2 |            2 |
| Domas     | Sabaliauskas |          2 |            2 |
| Tautvydas | Ubartas      |          2 |            3 |
| Arnoldas  | Jačas        |          2 |            2 |
| Jaunius   | Šindeikis    |          2 |            1 |
| Rimantas  | Kundrotas    |          2 |            3 |
| Egidijus  | Antanaitis   |          2 |            4 |
| Lukas     | Antanaitis   |          2 |            4 |

Išrinkite visus darbuotojų vardus, išskyrus tuos, kurių vardai
prasideda raide “A” .

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
  select vardas from darbuotojas where vardas like 'A%'
  -- select vardas, PAVARDĖ, skyrius_id, projektas_id from darbuotojas where skyrius_id = "2" or projektas_id="1"
  -- select * from projektas
  -- select * from darbuotojas
#+end_src

#+RESULTS:
| VARDAS   |
|----------|
| Arnoldas |
| Arnoldas |
| Arnas    |

Išrinkite duomenis apie darbuotojus (vardą, pavardę ir nuo kada dirba)
iš lentelės DARBUOTOJAS ir išrikiuokite visus duomenis nuo dirbančio
seniausiai iki naujausiai.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
  select vardas, PAVARDĖ, dirba_nuo from darbuotojas order by dirba_nuo
  -- select vardas, PAVARDĖ, skyrius_id, projektas_id from darbuotojas where skyrius_id = "2" or projektas_id="1"
  -- select * from projektas
  -- select * from darbuotojas
#+end_src

#+RESULTS:
| VARDAS    | PAVARDĖ       |  DIRBA_NUO |
|-----------+---------------+------------|
| Arnoldas  | Lukas         | 2002-02-30 |
| Urtė      | Lukaitė       | 2005-02-02 |
| Mikas     | Taileikis     | 2008-05-25 |
| Goda      | Jablonkskaitė | 2009-04-06 |
| Arnas     | Lukša         | 2009-11-15 |
| Milda     | Babavičiūtė   | 2010-07-15 |
| Giedrius  | Vaicekauskas  | 2010-07-30 |
| Martynas  | Jačas         | 2011-02-02 |
| Egidijus  | Antanaitis    | 2011-02-03 |
| Romas     | Babavičius    | 2011-09-30 |
| Lukas     | Antanaitis    | 2011-12-02 |
| Mantas    | Gabalis       | 2012-12-15 |
| Arnoldas  | Jačas         | 2014-03-03 |
| Jaunius   | Šindeikis     | 2014-06-08 |
| Maja      | Jačiulytė     | 2015-11-30 |
| Domas     | Sabaliauskas  | 2016-08-15 |
| Rimantas  | Kundrotas     | 2017-02-02 |
| Tautvydas | Ubartas       | 2017-06-06 |
| Henrikas  | Sabutis       | 2018-02-02 |
| Dainius   | Sabutis       | 2018-12-12 |

Išrinkite duomenis apie darbuotojus (vardą, pavardę ir nuo kada dirba)
iš lentelės DARBUOTOJAS ir išrikiuokite visus duomenis nuo dirbančio
naujausiai iki seniausiai.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
  select vardas, PAVARDĖ, dirba_nuo from darbuotojas order by dirba_nuo DESC
#+end_src

#+RESULTS:
| VARDAS    | PAVARDĖ       |  DIRBA_NUO |
|-----------+---------------+------------|
| Dainius   | Sabutis       | 2018-12-12 |
| Henrikas  | Sabutis       | 2018-02-02 |
| Tautvydas | Ubartas       | 2017-06-06 |
| Rimantas  | Kundrotas     | 2017-02-02 |
| Domas     | Sabaliauskas  | 2016-08-15 |
| Maja      | Jačiulytė     | 2015-11-30 |
| Jaunius   | Šindeikis     | 2014-06-08 |
| Arnoldas  | Jačas         | 2014-03-03 |
| Mantas    | Gabalis       | 2012-12-15 |
| Lukas     | Antanaitis    | 2011-12-02 |
| Romas     | Babavičius    | 2011-09-30 |
| Egidijus  | Antanaitis    | 2011-02-03 |
| Martynas  | Jačas         | 2011-02-02 |
| Giedrius  | Vaicekauskas  | 2010-07-30 |
| Milda     | Babavičiūtė   | 2010-07-15 |
| Arnas     | Lukša         | 2009-11-15 |
| Goda      | Jablonkskaitė | 2009-04-06 |
| Mikas     | Taileikis     | 2008-05-25 |
| Urtė      | Lukaitė       | 2005-02-02 |
| Arnoldas  | Lukas         | 2002-02-30 |

Išrinkite iš lentelės DARBUOTOJAS projektų ID, kurie būtų minimalus ir
maksimalus skaičius.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
  SELECT min(PROJEKTAS_ID), max(PROJEKTAS_ID) from DARBUOTOJAS
#+end_src

#+RESULTS:
| min(PROJEKTAS_ID) | max(PROJEKTAS_ID) |
|-------------------+-------------------|
|                 1 |                 5 |

Išrinkite duomenis apie tai, kiek kiekviename projekte yra priskirta
žmonių (projekto numeris ir skaičius, kiek jame dalyvauja žmonių).

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
  select projektas_id, count() from darbuotojas group by projektas_id
#+end_src

#+RESULTS:
| PROJEKTAS_ID | count() |
|--------------+---------|
|              |       1 |
|            1 |       3 |
|            2 |       6 |
|            3 |       4 |
|            4 |       3 |
|            5 |       3 |

#14 punkto užklausą pakoreguokite taip, kad rodytų tik tuos projektus,
kuriems priskirti daugiau nei 3 darbuotojai.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
  select projektas_id, count() from darbuotojas group by projektas_id having count() >3
#+end_src

#+RESULTS:
| PROJEKTAS_ID | count() |
|--------------+---------|
|            2 |       6 |
|            3 |       4 |

Išrinkite duomenis (projekto numeris, pareigos, skaičius) iš lentelės
DARBUOTOJAS, kiek programuotojų dirba kiekviename projekte.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai2.db :colnames yes
SELECT PROJEKTAS_ID, PAREIGOS, count() FROM DARBUOTOJAS WHERE PAREIGOS = 'Programuotojas' group by PROJEKTAS_ID
#+end_src

#+RESULTS:
| PROJEKTAS_ID | PAREIGOS       | count() |
|--------------+----------------+---------|
|            1 | Programuotojas |       1 |
|            2 | Programuotojas |       2 |
|            3 | Programuotojas |       2 |
|            4 | Programuotojas |       1 |
** Praktika

Parsisiųskite [[https://github.com/robotautas/kursas/blob/master/DB/db3/darbuotojai3.db][darbuotojai3.db]] duomenų bazę, atsidarykite ją programoje
DB Browser for SQLite ir skiltyje "Execute SQL" atlikite šias SQL
užklausas:

Išrinkite darbuotojų vardus ir pavardes kartu su projekto pavadinimu,
kuriame jie dirba.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai3.db :colnames yes
  -- SELECT *
  SELECT VARDAS, PAVARDĖ, PAVADINIMAS
  FROM DARBUOTOJAS
  INNER JOIN PROJEKTAS
  ON DARBUOTOJAS.PROJEKTAS_ID = PROJEKTAS.ID
#+end_src

#+RESULTS:
| VARDAS    | PAVARDĖ       | PAVADINIMAS       |
|-----------+---------------+-------------------|
| Martynas  | Jačas         | Galerija          |
| Goda      | Jablonkskaitė | Projektų valdymas |
| Mantas    | Gabalis       | Galerija          |
| Arnoldas  | Lukas         | Projektų valdymas |
| Maja      | Jačiulytė     | Apskaita          |
| Mikas     | Taileikis     | Pardavimai        |
| Giedrius  | Vaicekauskas  | Svetainė          |
| Romas     | Babavičius    | Svetainė          |
| Milda     | Babavičiūtė   | Projektų valdymas |
| Domas     | Sabaliauskas  | Projektų valdymas |
| Dainius   | Sabutis       | Projektų valdymas |
| Tautvydas | Ubartas       | Apskaita          |
| Henrikas  | Sabutis       | Apskaita          |
| Arnoldas  | Jačas         | Projektų valdymas |
| Jaunius   | Šindeikis     | Galerija          |
| Rimantas  | Kundrotas     | Apskaita          |
| Egidijus  | Antanaitis    | Pardavimai        |
| Lukas     | Antanaitis    | Pardavimai        |
| Arnas     | Lukša         | Svetainė          |

Išsirinkite darbuotojų dirbančių projekte Galerija vardus, pavardes ir
projekto pavadinimą.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai3.db :colnames yes
  SELECT VARDAS, PAVARDĖ, PAVADINIMAS
  from DARBUOTOJAS
  JOIN PROJEKTAS
  on PROJEKTAS.ID = DARBUOTOJAS.PROJEKTAS_ID where projektas.pavadinimas = "Galerija"
#+end_src

#+RESULTS:
| VARDAS   | PAVARDĖ   | PAVADINIMAS |
|----------+-----------+-------------|
| Martynas | Jačas     | Galerija    |
| Mantas   | Gabalis   | Galerija    |
| Jaunius  | Šindeikis | Galerija    |


Išrinkite visus projekto Projektų valdymas vykdytojus dirbančius
Pardavimų skyriuje.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai3.db :colnames yes
  SELECT * from DARBUOTOJAS
  JOIN SKYRIUS
  on SKYRIUS.id = DARBUOTOJAS.SKYRIUS_ID
  JOIN PROJEKTAS ON PROJEKTAS.ID = DARBUOTOJAS.PROJEKTAS_ID WHERE SKYRIUS.PAVADINIMAS = "Gamybos" AND PROJEKTAS.PAVADINIMAS = "Projektų valdymas"
#+end_src

#+RESULTS:
| ID | VARDAS   | PAVARDĖ      | ASMENS_KODAS | PAREIGOS       |  DIRBA_NUO | BAZINIS_ATLYGINIMAS | PRIEDAI | SKYRIUS_ID | PROJEKTAS_ID | ID | PAVADINIMAS | ID | PAVADINIMAS       |
|----+----------+--------------+--------------+----------------+------------+---------------------+---------+------------+--------------+----+-------------+----+-------------------|
|  4 | Arnoldas | Lukas        |  39402130000 | Programuotojas | 2002-02-30 |              2200.0 |     0.0 |          2 |            2 |  2 | Gamybos     |  2 | Projektų valdymas |
|  9 | Milda    | Babavičiūtė  |  48609190000 | Testuotojas    | 2010-07-15 |              1300.0 |   200.0 |          2 |            2 |  2 | Gamybos     |  2 | Projektų valdymas |
| 10 | Domas    | Sabaliauskas |  39903130000 | Testuotojas    | 2016-08-15 |              1200.0 |   200.0 |          2 |            2 |  2 | Gamybos     |  2 | Projektų valdymas |
| 14 | Arnoldas | Jačas        |  38506300000 | Programuotojas | 2014-03-03 |              1950.0 |   200.0 |          2 |            2 |  2 | Gamybos     |  2 | Projektų valdymas |


Išrinkite visas moteris, dirbančias projekte Projektų valdymas ir
išveskite į ekraną jų vardus, pavardes ir projekto pavadinimą.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai3.db :colnames yes
  SELECT VARDAS, PAVARDĖ, PAVADINIMAS
  FROM DARBUOTOJAS
  JOIN PROJEKTAS
  ON PROJEKTAS.ID = DARBUOTOJAS.PROJEKTAS_ID WHERE (ASMENS_KODAS LIKE "4%" OR ASMENS_KODAS like "6%") AND PROJEKTAS.PAVADINIMAS = "Projektų valdymas"
#+end_src

#+RESULTS:
| VARDAS | PAVARDĖ       | PAVADINIMAS       |
|--------+---------------+-------------------|
| Goda   | Jablonkskaitė | Projektų valdymas |
| Milda  | Babavičiūtė   | Projektų valdymas |

Išrinkite skyrių pavadinimus su juose dirbančių darbuotojų skaičiumi.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai3.db :colnames yes
  SELECT SKYRIUS.PAVADINIMAS, count()
  FROM DARBUOTOJAS
  JOIN SKYRIUS
  on SKYRIUS.ID = DARBUOTOJAS.SKYRIUS_ID GROUP by SKYRIUS.PAVADINIMAS
#+end_src

#+RESULTS:
| PAVADINIMAS | count() |
|-------------+---------|
| Finansų     |       2 |
| Gamybos     |      12 |
| Pardavimų   |       3 |
| Vadovybė    |       1 |

Apribokite #5 užklausos rezultatą taip, kad rodytų tik tuos skyrius
kur dirba bent 5 darbuotojai.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai3.db :colnames yes
  SELECT SKYRIUS.PAVADINIMAS, count()
  FROM DARBUOTOJAS
  JOIN SKYRIUS
  on SKYRIUS.ID = DARBUOTOJAS.SKYRIUS_ID GROUP by SKYRIUS.PAVADINIMAS HAVING count(*) > 5
#+end_src

#+RESULTS:
| PAVADINIMAS | count() |
|-------------+---------|
| Gamybos     |      12 |

Išrinkite darbuotojus (vardus, pavardes, pareigas) kartu su skyrių,
kuriuose jie dirba pavadinimais, tačiau nesančius tų skyrių vadovais.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai3.db :colnames yes
  SELECT VARDAS, PAVARDĖ, PAREIGOS, SKYRIUS.PAVADINIMAS
  FROM DARBUOTOJAS
  JOIN SKYRIUS
  on SKYRIUS.ID = DARBUOTOJAS.SKYRIUS_ID WHERE NOT PAREIGOS="Vadovas"
#+end_src

#+RESULTS:
| VARDAS    | PAVARDĖ       | PAREIGOS       | PAVADINIMAS |
|-----------+---------------+----------------+-------------|
| Martynas  | Jačas         | Programuotojas | Gamybos     |
| Goda      | Jablonkskaitė | Vadybininkas   | Pardavimų   |
| Mantas    | Gabalis       | Testuotojas    | Gamybos     |
| Arnoldas  | Lukas         | Programuotojas | Gamybos     |
| Maja      | Jačiulytė     | Buhalterė      | Finansų     |
| Mikas     | Taileikis     | Programuotojas | Gamybos     |
| Romas     | Babavičius    | Finansininkas  | Finansų     |
| Milda     | Babavičiūtė   | Testuotojas    | Gamybos     |
| Domas     | Sabaliauskas  | Testuotojas    | Gamybos     |
| Dainius   | Sabutis       | Vadybininkas   | Pardavimų   |
| Tautvydas | Ubartas       | Programuotojas | Gamybos     |
| Henrikas  | Sabutis       | Vadybininkas   | Pardavimų   |
| Arnoldas  | Jačas         | Programuotojas | Gamybos     |
| Rimantas  | Kundrotas     | Programuotojas | Gamybos     |
| Egidijus  | Antanaitis    | Testuotojas    | Gamybos     |
| Lukas     | Antanaitis    | Testuotojas    | Gamybos     |


Sukurkite naują įrašą lentelėje “DARBUOTOJAS” (asmens kodas:
38807117896, vardas: Pranas, pavardė: Logis, Dirba nuo: 2009-11-12,
visa kita - Null).

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai3.db :colnames yes
  INSERT INTO DARBUOTOJAS
  VALUES (NULL, "Pranas", "Logis", 38807117896, NULL, "2009-11-12", NULL, NULL, NULL, NULL)
#+end_src

Išrinkite darbuotojų vardus, pavardes ir skyriaus pavadinimą.
Rodykite, net ir tuos darbuotojus, kurie nedirba jokiame skyriuje
(skyriaus pavadinimą pasiimkite iš lentelės SKYRIUS).

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai3.db :colnames yes
  SELECT VARDAS, PAVARDĖ, PAVADINIMAS
  FROM DARBUOTOJAS
  LEFT JOIN SKYRIUS on DARBUOTOJAS.SKYRIUS_ID = SKYRIUS.ID
#+end_src

#+RESULTS:
| VARDAS    | PAVARDĖ       | PAVADINIMAS |
|-----------+---------------+-------------|
| Martynas  | Jačas         | Gamybos     |
| Goda      | Jablonkskaitė | Pardavimų   |
| Mantas    | Gabalis       | Gamybos     |
| Arnoldas  | Lukas         | Gamybos     |
| Maja      | Jačiulytė     | Finansų     |
| Mikas     | Taileikis     | Gamybos     |
| Giedrius  | Vaicekauskas  | Vadovybė    |
| Romas     | Babavičius    | Finansų     |
| Milda     | Babavičiūtė   | Gamybos     |
| Domas     | Sabaliauskas  | Gamybos     |
| Dainius   | Sabutis       | Pardavimų   |
| Tautvydas | Ubartas       | Gamybos     |
| Henrikas  | Sabutis       | Pardavimų   |
| Arnoldas  | Jačas         | Gamybos     |
| Jaunius   | Šindeikis     | Gamybos     |
| Rimantas  | Kundrotas     | Gamybos     |
| Egidijus  | Antanaitis    | Gamybos     |
| Lukas     | Antanaitis    | Gamybos     |
| Arnas     | Lukša         |             |
| Urtė      | Lukaitė       |             |
| Pranas    | Logis         |             |


1# punkto užklausą pataisykite taip, kad rodytų tik tuos vardus ir
projektų pavadinimus kuriuose dirba daugiau nei 4 darbuotojai.

#+begin_src sqlite :db ~/Dropbox/src/db/darbuotojai3.db :colnames yes
  SELECT VARDAS, PAVARDĖ, PROJEKTAS.PAVADINIMAS
  FROM DARBUOTOJAS
  JOIN PROJEKTAS
  on PROJEKTAS.ID = DARBUOTOJAS.PROJEKTAS_ID where PROJEKTAS_ID in (SELECT PROJEKTAS_ID FROM DARBUOTOJAS GROUP by PROJEKTAS_ID HAVING count() > 4)
#+end_src

#+RESULTS:
| VARDAS   | PAVARDĖ       | PAVADINIMAS       |
|----------+---------------+-------------------|
| Goda     | Jablonkskaitė | Projektų valdymas |
| Arnoldas | Lukas         | Projektų valdymas |
| Milda    | Babavičiūtė   | Projektų valdymas |
| Domas    | Sabaliauskas  | Projektų valdymas |
| Dainius  | Sabutis       | Projektų valdymas |
| Arnoldas | Jačas         | Projektų valdymas |
** Praktika
1. sukurti duomenu baze pagal diagrama

#+begin_src sqlite :db ~/Dropbox/src/db/shop.db :colnames yes
CREATE TABLE status (
  id integer PRIMARY KEY NOT NULL,
  name string
);
#+end_src

#+RESULTS:

#+begin_src sqlite :db ~/Dropbox/src/db/shop.db :colnames yes
  CREATE TABLE customer (
    id integer PRIMARY KEY NOT NULL,
    f_name string,
    l_name string,
    email VARCHAR(100) UNIQUE
  );
#+end_src

#+RESULTS:

#+begin_src sqlite :db ~/Dropbox/src/db/shop.db :colnames yes
  CREATE TABLE product (
  id integer PRIMARY KEY NOT NULL,
  name string,
  price float
  );
#+end_src

#+RESULTS:

#+begin_src sqlite :db ~/Dropbox/src/db/shop.db :colnames yes
  CREATE TABLE order_ (
  id integer PRIMARY KEY NOT NULL,
  customer_id integer UNIQUE,
  date_ string,
  status_id integer UNIQUE,
  FOREIGN KEY (customer_id) REFERENCES customer (id),
  FOREIGN KEY (status_id) REFERENCES status (id)
  );
#+end_src

#+RESULTS:

#+begin_src sqlite :db ~/Dropbox/src/db/shop.db :colnames yes
  CREATE TABLE product_order(
          quantity integer,
          order_id integer,
          product_id integer,
          FOREIGN KEY (order_id) REFERENCES order_ (id),
          FOREIGN KEY (product_id) REFERENCES product (id)
  );
#+end_src

#+RESULTS:



2. Uzpildyti duomenimis
   - bent 3 klientai, bent 5 užsakymai, kiekviename jų po 1-3
     pozicijas, keletas produktų, keletas užsakymo statusų (pvz,
     patvirtintas, vykdomas, įvykdytas, atmestas).

#+begin_src sqlite :db ~/Dropbox/src/db/shop.db :colnames yes
  INSERT INTO "customer" ("f_name", "l_name", "email") VALUES ('Jonas', 'Jonaitis', 'jj@gmail.com');
  INSERT INTO "customer" ("f_name", "l_name", "email") VALUES ('Antanas', 'Antanaitis', 'aa@gmail.com');
  INSERT INTO "customer" ("f_name", "l_name", "email") VALUES ('Juozas', 'Juozaitis', 'jj@hotmail.com');
  INSERT INTO "customer" ("f_name", "l_name", "email") VALUES ('Petras', 'Petraitis', 'pp@mail.lt');
  INSERT INTO "customer" ("f_name", "l_name", "email") VALUES ('Virgis', 'Virgutis', 'vv@gmail.com');
  INSERT INTO "customer" ("f_name", "l_name", "email") VALUES ('Tomas', 'Aidietis', 'ta@imone.lt');
#+end_src

#+RESULTS:

#+begin_src sqlite :db ~/Dropbox/src/db/shop.db :colnames yes
  INSERT INTO "status" ("name") VALUES ('Atmestas');
  INSERT INTO "status" ("name") VALUES ('Vykdomas');
  INSERT INTO "status" ("name") VALUES ('Patvirtintas');
  INSERT INTO "status" ("name") VALUES ('Ivykdytas');
#+end_src

#+RESULTS:

#+begin_src sqlite :db ~/Dropbox/src/db/shop.db :colnames yes
  INSERT INTO "product" ("name", "price") VALUES ('Agurkai', '20,99');
  INSERT INTO "product" ("name", "price") VALUES ('Kisielius', '3,59');
  INSERT INTO "product" ("name", "price") VALUES ('Prozektorius', '8,99');
  INSERT INTO "product" ("name", "price") VALUES ('Grikiai', '2,99');
#+end_src

#+RESULTS:

#+begin_src sqlite :db ~/Dropbox/src/db/shop.db :colnames yes
  INSERT INTO "order_" ("customer_id", "date_", "status_id") VALUES (7, '2022-01-01', 3);
#+end_src

#+begin_src sqlite :db ~/Dropbox/src/db/shop.db :colnames yes
  INSERT INTO "product_order" ("order_id", "product_id", "quantity") VALUES (1, 3, 10);
#+end_src

#+RESULTS:

I lentele duomenys susidejo, bet belenkaip painu ka as cia realiai turiu

3. Suformuoti pora uzklausu
   - Kad rezultate matytųsi užsakymo id, užsakovo pavardė, data,
     bendra užsakymo suma:

     #+begin_src sqlite :db ~/Dropbox/src/db/shop.db :colnames yes
       select order_id, date_, l_name, quantity*price AS Bendra_suma
       from order_
       INNER JOIN customer
       ON order_.customer_id = customer.id
       Inner join product_order
       on order_.id = product_order.order_id
       inner join product
       on product.id = product_order.product_id
     #+end_src

     #+RESULTS:
     | order_id |      date_ | l_name    | Bendra_suma |
     |----------+------------+-----------+-------------|
     |        1 | 2022-01-01 | Aidietis  |          80 |
     |        2 | 2022-01-01 | Petraitis |          10 |
     |        2 | 2022-01-01 | Petraitis |         140 |


   - Kad rezultate matytųsi užsakymo id, pozicijos su kiekiais,
     kainomis ir bendra pozicijos suma:

     #+begin_src sqlite :db ~/Dropbox/src/db/shop.db :colnames yes
       select order_id, name, quantity, price, quantity*price AS Bendra_suma
       from order_
       INNER JOIN customer
       ON order_.customer_id = customer.id
       Inner join product_order
       on order_.id = product_order.order_id
       inner join product
       on product.id = product_order.product_id
     #+end_src

     #+RESULTS:
     | order_id | name         | quantity | price | Bendra_suma |
     |----------+--------------+----------+-------+-------------|
     |        1 | Prozektorius |       10 | 8,99  |          80 |
     |        2 | Grikiai      |        5 | 2,99  |          10 |
     |        2 | Agurkai      |        7 | 20,99 |         140 |

     Arba toks Monikos valaites sprendimas
     #+begin_src sqlite :db ~/Dropbox/src/db/shop.db :colnames yes
       SELECT name, sum(quantity), price, sum(quantity)*price as total
       from product_order
       JOIN order_ on order_.id = product_order.order_id
       JOIN product on product.id = product_order.product_id
       GROUP BY name
     #+end_src

     #+RESULTS:
     | name         | sum(quantity) | price | total |
     |--------------+---------------+-------+-------|
     | Agurkai      |             7 | 20,99 |   140 |
     | Grikiai      |             5 | 2,99  |    10 |
     | Prozektorius |            10 | 8,99  |    80 |

   - Prieš tai buvusios užklausos pagrindu sukurkite užklausą, kurioje
     matytųsi, kiek ir kokio produkto buvo užsakyta:
